In [2]:
# Dependencies and Setup
import pandas as pd
import os

# File to Load (Remember to Change These)
pymoli_file = os.path.join("..", "HeroesofPymoli", "purchase_data.csv")

# Read Purchasing File and store into Pandas data frame
pymoli_df = pd.read_csv(pymoli_file)
pymoli_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
unique_players = pymoli_df["SN"].nunique()
pd.DataFrame({"Number of Players": [unique_players]})

   Number of Players
0                576

In [4]:
unique_items = pymoli_df["Item ID"].nunique()
pd.DataFrame({"Unique Items": [unique_items]})

   Unique Items
0           179

In [5]:
avg_price = pymoli_df["Price"].mean()
avg_price

3.050987179487176

In [6]:
total_purchases = pymoli_df["Item ID"].count()
total_purchases

780

In [7]:
total_revenue = pymoli_df["Price"].sum()
total_revenue

2379.77

In [8]:
purchasing_analysis = pd.DataFrame({"Number of Unique Items": [unique_items],
                                   "Average Price": [avg_price],
                                   "Number of Purchases": [total_purchases],
                                   "Total Revenue": [total_revenue]})
purchasing_analysis

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [9]:
drop_duplicates = pymoli_df[["Gender", "Age", "SN"]].drop_duplicates()
drop_duplicates

     Gender  Age             SN
0      Male   20        Lisim78
1      Male   40    Lisovynya38
2      Male   24     Ithergue48
3      Male   24  Chamassasya86
4      Male   23      Iskosia90
..      ...  ...            ...
773    Male   21         Hala31
774    Male   11     Jiskjask80
775  Female   21     Aethedru70
777    Male   20     Yathecal72
778    Male    7        Sisur91

[576 rows x 3 columns]

In [10]:
gender_counts = drop_duplicates["Gender"].value_counts()
gender_counts

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [11]:
percentageof_players = gender_counts/unique_players*100
percentageof_players

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [12]:
pd.DataFrame({"Total Count": gender_counts, "Percentage of Players": percentageof_players})

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [13]:
groupby_gender = pymoli_df.groupby(["Gender"])
groupby_gender.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [14]:
purchase_value = groupby_gender.sum()["Price"]
purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [15]:
purchase_count = groupby_gender.count()["Purchase ID"]
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [16]:
avg_purchaseprice = groupby_gender.mean()["Price"]
avg_purchaseprice

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [17]:
avg_totalperperson = purchase_value/gender_counts
avg_totalperperson

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [18]:
purchasing_analysis_gender = pd.DataFrame({"Purchase Count": purchase_count,
                                  "Average Purchase Price": avg_purchaseprice,
                                    "Total Purchase Value": purchase_value,
                                   "Avg Total Purchase per Person": avg_totalperperson})
purchasing_analysis_gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [19]:
bins = [0,9,14,19,24,29,34,39,100]
group_names =["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [20]:
pymoli_df["Age Range"] = pd.cut(pymoli_df["Age"], bins, labels=group_names)
pymoli_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [24]:
age_groups = pymoli_df.groupby("Age Range").nunique()

In [25]:
percentage_of_players = age_groups["SN"]/[unique_players]*100
percentage_of_players

Age Range
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [26]:
age_demographics_df = pd.DataFrame({
                                   "Total Count": age_groups["SN"],
                                   "Percentage of Players": percentage_of_players})
age_demographics_df

           Total Count  Percentage of Players
Age Range
<10                 17               2.951389
10-14               22               3.819444
15-19              107              18.576389
20-24              258              44.791667
25-29               77              13.368056
30-34               52               9.027778
35-39               31               5.381944
40+                 12               2.083333

In [43]:
age_groups = pymoli_df.groupby("Age Range")
age_groups["Price"].sum()

Age Range
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [44]:
total_purchase_value = age_groups["Price"].sum()

In [45]:
age_groups["Price"].mean()

Age Range
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [46]:
average_purchase_price = age_groups["Price"].mean()

In [47]:
age_groups = pymoli_df.groupby("Age Range")
age_groups["Item ID"].count()

Age Range
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Item ID, dtype: int64

In [48]:
purchase_count = age_groups["Item ID"].count()

In [49]:
total_age = age_groups['SN'].nunique()

In [51]:
purchase_age_count = age_groups['Purchase ID'].count()
average_purchase_price_age = age_groups['Price'].mean()
total_purchase_value = age_groups['Price'].sum()
average_purchase_per_person_age = (total_purchase_value/total_age)

pd.DataFrame({'Purchase Count': purchase_count, 'Average Purchase Price': average_purchase_price,
              'Total Purchase Value': total_purchase_value,
             'Average Purchase Total per Person': average_purchase_per_person_age})

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Age Range,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [53]:
top_spenders = pymoli_df.groupby('SN')

In [57]:
count_purchase_spender = top_spenders['Purchase ID'].count()
count_purchase_spender.head()

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Name: Purchase ID, dtype: int64

In [58]:
count_purchase_spender = top_spenders['Purchase ID'].count()

In [59]:
avg_purchase_price_per_spender = top_spenders['Price'].mean()
avg_purchase_price_per_spender

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [63]:
purchase_total = top_spenders['Price'].sum()

In [64]:
ts = pd.DataFrame({'Purchase Count': count_purchase_spender,
            'Average Purchase Price': avg_purchase_price_per_spender,
             'Total Purchase Value': purchase_total})

top_spender = ts.sort_values(['Total Purchase Value'], ascending=False)
top_spender.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [68]:
item_name = pymoli_df[['Item ID', 'Item Name', 'Price']]
grouped_items = item_name.groupby(['Item ID', 'Item Name'])

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
764      113                          Solitude's Reaver   4.07
765      130                                      Alpha   2.07
766       58          Freak's Bite, Favor of Holy Might   4.14
777       67      Celeste, Incarnation of the Corrupted   3.46
779       50                                       Dawn   4.60

[690 rows x 3 columns]

In [66]:
purchasing_count = grouped_items['Price'].count()
purchasing_total = grouped_items['Price'].sum()
price = (purchasing_total/purchasing_count)

In [69]:
mpi = pd.DataFrame({'Purchase Count': purchasing_count, 
                   'Item Price': price, 
                   'Total Purchase Value': purchasing_total})

most_popular_items = mpi.sort_values(['Purchase Count'], ascending=False)
most_popular_items.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [70]:
most_profitable_items = mpi.sort_values(['Total Purchase Value'], ascending=False)
most_profitable_items.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80